; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared5 - mode
	thermograph0 - mode
	spectrograph1 - mode
	image3 - mode
	thermograph4 - mode
	spectrograph2 - mode
	GroundStation6 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star3 - direction
	Star5 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument1 infrared5)
	(supports instrument1 image3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared5)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared5)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 infrared5)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared5)
	(supports instrument6 image3)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star5)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star5)
	(supports instrument8 spectrograph1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(have_image Planet7 thermograph0)
	(have_image Planet8 thermograph0)
	(have_image Planet8 infrared5)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 spectrograph2)
	(have_image Star11 image3)
	(have_image Star11 infrared5)
))

)

; plan
1. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 7
2. (calibrate satellite3 instrument6 star4)
   added: (calibrated instrument6)
   goals met: 0 of 7
3. (turn_to satellite3 star11 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 star11)
   goals met: 0 of 7
4. (take_image satellite3 star11 instrument6 infrared5)
   added: (have_image star11 infrared5)
   goals met: 1 of 7
5. (take_image satellite3 star11 instrument6 image3)
   added: (have_image star11 image3)
   goals met: 2 of 7
6. (turn_to satellite3 planet10 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 planet10)
   goals met: 2 of 7
7. (turn_to satellite2 groundstation1 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation1)
   goals met: 2 of 7
8. (take_image satellite3 planet10 instrument6 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 3 of 7
9. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 3 of 7
10. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 3 of 7
11. (turn_to satellite2 phenomenon9 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 7
12. (take_image satellite2 phenomenon9 instrument4 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 4 of 7
13. (turn_to satellite2 planet7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet7)
   goals met: 4 of 7
14. (take_image satellite2 planet7 instrument4 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 5 of 7
15. (turn_to satellite2 planet8 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet8)
   goals met: 5 of 7
16. (take_image satellite2 planet8 instrument4 infrared5)
   added: (have_image planet8 infrared5)
   goals met: 6 of 7
17. (take_image satellite2 planet8 instrument4 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 7 of 7
